MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ128MC510/mcu.h
#define BWRP_WRPROTECT_ON    0x00CE
#define BWRP_WRPROTECT_OFF   0x00CF

#define BSS_LARGE_FLASH_HIGH 0x00C1
#define BSS_HIGH_LARGE_BOOT_CODE 0x00C1
#define BSS_MEDIUM_FLASH_HIGH 0x00C3
#define BSS_HIGH_MEDIUM_BOOT_CODE 0x00C3
#define BSS_SMALL_FLASH_HIGH 0x00C5
#define BSS_HIGH_SMALL_BOOT_CODE 0x00C5
#define BSS_LARGE_FLASH_STD  0x00C9
#define BSS_STRD_LARGE_BOOT_CODE 0x00C9
#define BSS_MEDIUM_FLASH_STD 0x00CB
#define BSS_STRD_MEDIUM_BOOT_CODE 0x00CB
#define BSS_SMALL_FLASH_STD  0x00CD
#define BSS_STRD_SMALL_BOOT_CODE 0x00CD
#define BSS_NO_FLASH         0x00CF
#define BSS_NO_BOOT_CODE     0x00CF

#define RBS_LARGE_RAM        0x000F
#define RBS_LARGE_BOOT_RAM   0x000F
#define RBS_MEDIUM_RAM       0x004F
#define RBS_MEDIUM_BOOT_RAM  0x004F
#define RBS_SMALL_RAM        0x008F
#define RBS_SMALL_BOOT_RAM   0x008F
#define RBS_NO_RAM           0x00CF
#define RBS_NO_BOOT_RAM      0x00CF

/* Register FSS (0xf80002)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSS;
#define _FSS(x) __attribute__((address(0xf80002),deprecated_definition("consider migrating to #pragma config"),section("__FSS.sec"),space(prog))) __prog__ uint16_t _FSS = (x);

/*
** Only one invocation of FSS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSS.
** Multiple options may be combined, as shown:
**
** _FSS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Secure Segment Program Write Protect:
**     SWRP_WRPROTECT_ON    Secure segment is write protected
**     SWRP_WRPROTECT_OFF   Secure Segment may be written
**
**   Secure Segment Program Flash Code Protection:
**     SSS_LARGE_FLASH_HIGH High Security, Large-sized Secure Flash
**     SSS_HIGH_LARGE_SEC_CODEHigh Security, Large-sized Secure Flash
**     SSS_MEDIUM_FLASH_HIGHHigh Security, Medium-sized Secure Flash
**     SSS_HIGH_MEDIUM_SEC_CODEHigh Security, Medium-sized Secure Flash
**     SSS_SMALL_FLASH_HIGH High Security, Small-sized Secure Flash
**     SSS_HIGH_SMALL_SEC_CODEHigh Security, Small-sized Secure Flash
**     SSS_LARGE_FLASH_STD  Standard Security, Large-sized Secure Flash
**     SSS_STRD_LARGE_SEC_CODEStandard Security, Large-sized Secure Flash
**     SSS_MEDIUM_FLASH_STD Standard Security, Medium-sized Secure Flash
**     SSS_STRD_MEDIUM_SEC_CODEStandard Security, Medium-sized Secure Flash
**     SSS_SMALL_FLASH_STD  Standard Security, Small-sized Secure Flash
**     SSS_STRD_SMALL_SEC_CODEStandard Security, Small-sized Secure Flash
**     SSS_NO_FLASH         No Secure Segment
**     SSS_NO_SEC_CODE      No Secure Segment
**
**   Secure Segment Data RAM Protection:
**     RSS_LARGE_RAM        Large-sized Secure RAM
**     RSS_LARGE_SEC_RAM    Large-sized Secure RAM
**     RSS_MEDIUM_RAM       Medium-sized Secure RAM
**     RSS_MEDIUM_SEC_RAM   Medium-sized Secure RAM
**     RSS_SMALL_RAM        Small-sized Secure RAM
**     RSS_SMALL_SEC_RAM    Small-sized Secure RAM
**     RSS_NO_RAM           No Secure RAM
**     RSS_NO_SEC_RAM       No Secure RAM
**
*/

#define SWRP_WRPROTECT_ON    0xFFCE
#define SWRP_WRPROTECT_OFF   0xFFCF

#define SSS_LARGE_FLASH_HIGH 0xFFC1
#define SSS_HIGH_LARGE_SEC_CODE 0xFFC1
#define SSS_MEDIUM_FLASH_HIGH 0xFFC3
#define SSS_HIGH_MEDIUM_SEC_CODE 0xFFC3
#define SSS_SMALL_FLASH_HIGH 0xFFC5
#define SSS_HIGH_SMALL_SEC_CODE 0xFFC5
#define SSS_LARGE_FLASH_STD  0xFFC9
#define SSS_STRD_LARGE_SEC_CODE 0xFFC9
#define SSS_MEDIUM_FLASH_STD 0xFFCB
#define SSS_STRD_MEDIUM_SEC_CODE 0xFFCB
#define SSS_SMALL_FLASH_STD  0xFFCD
#define SSS_STRD_SMALL_SEC_CODE 0xFFCD
#define SSS_NO_FLASH         0xFFCF
#define SSS_NO_SEC_CODE      0xFFCF

#define RSS_LARGE_RAM        0xFF0F
#define RSS_LARGE_SEC_RAM    0xFF0F
#define RSS_MEDIUM_RAM       0xFF4F
#define RSS_MEDIUM_SEC_RAM   0xFF4F
#define RSS_SMALL_RAM        0xFF8F
#define RSS_SMALL_SEC_RAM    0xFF8F
#define RSS_NO_RAM           0xFFCF
#define RSS_NO_SEC_RAM       0xFFCF

/* Register FGS (0xf80004)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FGS;
#define _FGS(x) __attribute__((address(0xf80004),deprecated_definition("consider migrating to #pragma config"),section("__FGS.sec"),space(prog))) __prog__ uint16_t _FGS = (x);

/*
** Only one invocation of FGS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FGS.
** Multiple options may be combined, as shown:
**
** _FGS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   General Code Segment Write Protect:
**     GWRP_ON              User program memory is write-protected
**     GWRP_OFF             User program memory is not write-protected
**
**   General Segment Code Protection:
**     GSS_HIGH             High Security Code Protection is Enabled
**     GSS_STD              Standard Security Code Protection is Enabled
**     GCP_ON               Standard Security Code Protection is Enabled
**     GSS_OFF              User program memory is not code-protected
**     GCP_OFF              User program memory is not code-protected
**
*/

#define GWRP_ON              0x0006
#define GWRP_OFF             0x0007

#define GSS_HIGH             0x0003
#define GSS_STD              0x0005
#define GCP_ON               0x0005
#define GSS_OFF              0x0007
#define GCP_OFF              0x0007

/* Register FOSCSEL (0xf80006)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSCSEL;
#define _FOSCSEL(x) __attribute__((address(0xf80006),deprecated_definition("consider migrating to #pragma config"),section("__FOSCSEL.sec"),space(prog))) __prog__ uint16_t _FOSCSEL = (x);

/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Oscillator Mode:
**     FNOSC_FRC            Internal Fast RC (FRC)
**     FNOSC_FRCPLL         Internal Fast RC (FRC) w/ PLL
**     FNOSC_PRI            Primary Oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary Oscillator (XT, HS, EC) w/ PLL
**     FNOSC_SOSC           Secondary Oscillator (SOSC)
**     FNOSC_LPRC           Low Power RC Oscillator (LPRC)
**     FNOSC_FRCDIV16       Internal Fast RC (FRC) divide by 16
**     FNOSC_LPRCDIVN       Internal Fast RC (FRC) with divide by N
**
**   Two-speed Oscillator Start-Up Enable:
**     IESO_OFF             Start up with user-selected oscillator
**     IESO_ON              Start up with FRC, then switch
**
*/

